HW8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ru" xml:lang="ru">
<head>
<!-- 2016-11-29 Tue 13:15 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ДЗ 8</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Михаил Волхов M3438" />
</head>
<body>
<div id="content">
<h1 class="title">ДЗ 8</h1>
<div id="table-of-contents">
<h2>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Проектирование базы Airlines</a></li>
<li><a href="#orgheadline2">2. Запросы к базе</a></li>
<li><a href="#orgheadline3">3. Индексы</a></li>
</ul>
</div>
</div>
<p>
Весь sql-код написан и протестирован на <code>PostgreSQL 9.5.4</code>.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Проектирование базы Airlines</h2>
<div class="outline-text-2" id="text-1">
<p>
Для начала определимся с таблицами, которые уже предоставлены
(<code>Flights(FlightId, FligtTime, PlaneId), Seats(PlaneId, SeatNo)</code>) и
создадим их. Добавим поле <code>SoldOut</code> в <code>Flights</code>, что будет
семантически соответствовать требованию "продажи автоматически
закрываются не позднее двух часов до вылета рейса, либо при
распродаже всех мест либо по запросу администратора".
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">DROP</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">IF</span> <span style="color: #FFA070;">EXISTS</span> Seats;
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">Seats</span>(
    PlaneId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span>,
    SeatNum <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>
);

<span style="color: #FFA070;">DROP</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">IF</span> <span style="color: #FFA070;">EXISTS</span> Flights;
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">Flights</span>(
  FlightId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span>,
  FlightTime <span style="color: #EF5C5F;">timestamp</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
  PlaneId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
  SoldOut <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,

  <span style="color: #FFA070;">FOREIGN</span> <span style="color: #FFA070;">KEY</span> (PlaneId) <span style="color: #FFA070;">REFERENCES</span> Seats(PlaneId) <span style="color: #FFA070;">ON</span> <span style="color: #FFA070;">DELETE</span> <span style="color: #FFA070;">CASCADE</span>
);
</pre>
</div>

<p>
Для бронирования и покупки мест создадим следующую физическую
модель: хранить билеты будем в таблице <code>Tickets</code>, представляя
бронирования как неоплаченные билеты. Это поможет предоставить
гарантию того, что место не может быть купленым и забронированным
одновременно.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">DROP</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">IF</span> <span style="color: #FFA070;">EXISTS</span> Tickets;
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">TABLE</span> <span style="color: #8AAFFA;">Tickets</span>(
    UserId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
    FlightId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
    SeatId <span style="color: #EF5C5F;">int</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span>,
    Expiration <span style="color: #EF5C5F;">timestamp</span>,
    IsPaid <span style="color: #EF5C5F;">boolean</span> <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">NULL</span> <span style="color: #FFA070;">DEFAULT</span> <span style="color: #FFA070;">False</span>,

    <span style="color: #FFA070;">PRIMARY</span> <span style="color: #FFA070;">KEY</span> (UserId, FlightId, SeatId),
    <span style="color: #FFA070;">FOREIGN</span> <span style="color: #FFA070;">KEY</span> (FlightId) <span style="color: #FFA070;">REFERENCES</span> Flights(FlightId) <span style="color: #FFA070;">ON</span> <span style="color: #FFA070;">DELETE</span> <span style="color: #FFA070;">CASCADE</span>,
    <span style="color: #FFA070;">UNIQUE</span>(FlightId, SeatId) <span style="color: #637579;">-- &#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1076;&#1072;&#1085;&#1086;/&#1079;&#1072;&#1073;&#1088;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1076;&#1074;&#1072;&#1078;&#1076;&#1099;</span>
);
</pre>
</div>

<p>
Заполним таблицу тестовыми данными:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">DELETE</span> <span style="color: #FFA070;">FROM</span> Seats <span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">True</span>;
<span style="color: #FFA070;">INSERT</span> <span style="color: #FFA070;">INTO</span> Seats <span style="color: #FFA070;">VALUES</span>
  (111, 10),
  (222, 15),
  (333, 20);

<span style="color: #FFA070;">DELETE</span> <span style="color: #FFA070;">FROM</span> Flights <span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">True</span>;
<span style="color: #FFA070;">INSERT</span> <span style="color: #FFA070;">INTO</span> Flights <span style="color: #FFA070;">VALUES</span>
  (0, <span style="color: #868B44;">'2016-11-29 12:00:00'</span>, 111, <span style="color: #FFA070;">False</span>),
  (1, <span style="color: #868B44;">'2016-11-29 22:00:00'</span>, 222, <span style="color: #FFA070;">False</span>),
  (2, <span style="color: #868B44;">'2016-11-30 06:30:00'</span>, 333, <span style="color: #FFA070;">False</span>),
  (3, <span style="color: #868B44;">'2016-11-28 06:30:00'</span>, 222, <span style="color: #FFA070;">True</span>);

<span style="color: #FFA070;">DELETE</span> <span style="color: #FFA070;">FROM</span> Tickets <span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">True</span>;
<span style="color: #FFA070;">INSERT</span> <span style="color: #FFA070;">INTO</span> Tickets <span style="color: #FFA070;">VALUES</span>
  (0,0,2,<span style="color: #FFA070;">null</span>,<span style="color: #FFA070;">True</span>),
  (1,0,3,<span style="color: #868B44;">'2016-11-22 08:00:00'</span>,<span style="color: #FFA070;">False</span>),
  (2,2,5,<span style="color: #868B44;">'2016-11-29 12:00:00'</span>,<span style="color: #FFA070;">False</span>);
</pre>
</div>

<p>
Объявим список представлений, которые помогут в составлении
запросов в дальнейшем:
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #637579;">-- Flights we can buy tickets on.</span>
<span style="color: #FFA070;">DROP</span> <span style="color: #FFA070;">VIEW</span> <span style="color: #8AAFFA;">IF</span> <span style="color: #FFA070;">EXISTS</span> ValidFlights;
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">VIEW</span> <span style="color: #8AAFFA;">ValidFlights</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> FlightId, PlaneId <span style="color: #FFA070;">FROM</span> Flights
<span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">NOT</span> SoldOut <span style="color: #FFA070;">AND</span>
      FlightTime - now() &gt; <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'2 hour'</span>;

<span style="color: #637579;">-- (planeId, seatId) for every accessible seat in the plane</span>
<span style="color: #637579;">-- let's suppose there can't be more than 100 seats in plane</span>
<span style="color: #637579;">-- (we can use 1000 instead)</span>
<span style="color: #FFA070;">DROP</span> <span style="color: #FFA070;">VIEW</span> <span style="color: #8AAFFA;">IF</span> <span style="color: #FFA070;">EXISTS</span> AllSeats;
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">VIEW</span> <span style="color: #8AAFFA;">AllSeats</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> S.PlaneId, n <span style="color: #FFA070;">as</span> SeatId
<span style="color: #FFA070;">FROM</span> generate_series(1,100) <span style="color: #FFA070;">AS</span> a(n), Seats <span style="color: #FFA070;">AS</span> S
<span style="color: #FFA070;">WHERE</span> n &lt;= S.SeatNum
<span style="color: #FFA070;">ORDER</span> <span style="color: #FFA070;">BY</span> S.PlaneId;

<span style="color: #637579;">-- Seats for valid flights that are bought or booked. Intuitively</span>
<span style="color: #637579;">-- for all flights that are accessible, seats for them that</span>
<span style="color: #637579;">-- can't be booked right now.</span>
<span style="color: #FFA070;">DROP</span> <span style="color: #FFA070;">VIEW</span> <span style="color: #8AAFFA;">IF</span> <span style="color: #FFA070;">EXISTS</span> NonFreeSeats;
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">VIEW</span> <span style="color: #8AAFFA;">NonFreeSeats</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> FlightId, SeatId
<span style="color: #FFA070;">FROM</span> ValidFlights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Flights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> Tickets
<span style="color: #FFA070;">WHERE</span> IsPaid <span style="color: #FFA070;">OR</span> <span style="color: #637579;">-- payed tickets</span>
      (Expiration <span style="color: #FFA070;">is</span> <span style="color: #FFA070;">not</span> <span style="color: #FFA070;">null</span> <span style="color: #FFA070;">AND</span>
       now() &lt; Expiration <span style="color: #FFA070;">AND</span>
       FlightTime - Expiration &gt; <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'1 day'</span>);

<span style="color: #637579;">-- Seats that we can book or buy!</span>
<span style="color: #FFA070;">DROP</span> <span style="color: #FFA070;">VIEW</span> <span style="color: #8AAFFA;">IF</span> <span style="color: #FFA070;">EXISTS</span> FreeSeats;
<span style="color: #FFA070;">CREATE</span> <span style="color: #FFA070;">VIEW</span> <span style="color: #8AAFFA;">FreeSeats</span> <span style="color: #FFA070;">AS</span>
<span style="color: #FFA070;">SELECT</span> FlightId, SeatId
<span style="color: #FFA070;">FROM</span> ValidFlights <span style="color: #FFA070;">NATURAL</span> <span style="color: #FFA070;">JOIN</span> AllSeats
<span style="color: #FFA070;">WHERE</span> (FlightId,SeatId) <span style="color: #FFA070;">NOT</span> <span style="color: #FFA070;">IN</span> (<span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">from</span> NonFreeSeats);
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Запросы к базе</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><p>
Покупка билета.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">INSERT</span> <span style="color: #FFA070;">INTO</span> Tickets (UserId, FlightId, SeatId, IsPaid)
<span style="color: #FFA070;">SELECT</span> 5,2,8,<span style="color: #FFA070;">True</span> <span style="color: #637579;">-- some user data</span>
<span style="color: #FFA070;">ON</span> CONFLICT (FlightId,SeatId) DO <span style="color: #FFA070;">UPDATE</span> <span style="color: #FFA070;">SET</span> IsPaid = <span style="color: #FFA070;">True</span>
<span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">EXISTS</span> (
  <span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">FROM</span> FreeSeats
  <span style="color: #FFA070;">WHERE</span> FlightId = 2 <span style="color: #FFA070;">AND</span> SeatId = 8);
</pre>
</div>
<p>
При ошибке будет вставлено 0 рядов, что как бы
намекает. Аналогично и дальше.
</p></li>
<li><p>
Бронирование/продление бронирования
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">INSERT</span> <span style="color: #FFA070;">INTO</span> Tickets (UserId, FlightId, SeatId, Expiration, IsPaid)
<span style="color: #FFA070;">SELECT</span> 6,3,4,now() + <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'1 day'</span>,<span style="color: #FFA070;">False</span>
<span style="color: #FFA070;">ON</span> CONFLICT (FlightId,SeatId) DO
  <span style="color: #FFA070;">UPDATE</span> <span style="color: #FFA070;">SET</span> Expiration = now() + <span style="color: #EF5C5F;">INTERVAL</span> <span style="color: #868B44;">'1 day'</span>
<span style="color: #FFA070;">WHERE</span> <span style="color: #FFA070;">EXISTS</span> (
  <span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">FROM</span> FreeSeats
  <span style="color: #FFA070;">WHERE</span> FlightId = 2 <span style="color: #FFA070;">AND</span> SeatId = 8);
</pre>
</div></li>
<li><p>
Оплата брони.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">UPDATE</span> Tickets
<span style="color: #FFA070;">SET</span> IsPaid = <span style="color: #FFA070;">True</span>
<span style="color: #FFA070;">WHERE</span> UserId = 5 <span style="color: #FFA070;">AND</span>
      FlightId = 0 <span style="color: #FFA070;">AND</span>
      SeatId = 3 <span style="color: #FFA070;">AND</span>
      <span style="color: #FFA070;">EXISTS</span> (<span style="color: #FFA070;">SELECT</span> * <span style="color: #FFA070;">FROM</span> FreeSeats
              <span style="color: #FFA070;">WHERE</span> FlightId = 0 <span style="color: #FFA070;">AND</span> SeatId = 3);
</pre>
</div></li>
<li><p>
Реквест администратора заморозить продажи.
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">UPDATE</span> Flights <span style="color: #FFA070;">SET</span> SoldOut = <span style="color: #FFA070;">True</span> <span style="color: #FFA070;">WHERE</span> FlightId = 123;
</pre>
</div></li>
<li>Запросы на проверки мест тривиально выводятся из представлений в
первой части.</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Индексы</h2>
<div class="outline-text-2" id="text-3">
<p>
Определим потенциально частые запросы:
</p>
<ol class="org-ol">
<li><code>Flights</code>: поиск рейсов по времени &#x2013; поиск по временным
 промежуткам, упорядоченный индекс на (<code>FlightTime</code>). Индексы по
<code>PRIMARY KEY</code> автоматически есть.</li>
<li><code>Tickets</code>:
<ul class="org-ul">
<li>Список заказов пользователя по его ID: хэш индекс по <code>UserId</code>.</li>
<li>По id рейса и месту билеты/брони на него. Упорядоченный индекс
&#x2013; ускорятся как запросы "все места по этому рейсу" так и
"конкретное место конкретного рейса".</li>
</ul></li>
<li><code>Planes</code>: не вижу необходимости оптимизировать. Обычно самолетный
парк не то, чтобы очень большой, поэтому запросы должны быть и
так быстрыми. Но если очень нужно, то хэш индекс по номеру
самолета или id самолета (номера/модели самолета нету в моем
определении, но мог бы быть).</li>
</ol>


<p>
Пусть частым запросом является определение средней заполненности
самолёта по рейсу. Какие индексы могут помочь при исполнении данного
запроса?
</p>

<p>
Во-первых нужно в таблицу <code>Flights</code> добавить <code>FlightNum</code>, который
будет семантически соответствовать именно рейсу, а не id. Дальше на
нем построить хэш индекс. Также помогут уже упомянутые индексы на
<code>Tickets</code>, и, возможно, <code>Planes</code>, поскольку придется искать все
свободные места и их количество, а также сортировать по занятости
через <code>Tickets</code>. Формально данный запрос будет опираться на
использование представления <code>FreeSeats</code>, которое, в свою очередь,
опирается на select'ы из, преимущественно, <code>Tickets</code>. В реальной
имплементации я напишу хэш индекс на <code>FlightId</code>, существенной
разницы в смысле целей обучения нет.
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #FFA070;">CREATE</span> INDEX <span style="color: #FFA070;">ON</span> Flights <span style="color: #FFA070;">USING</span> btree (FlightTime);
<span style="color: #FFA070;">CREATE</span> INDEX <span style="color: #FFA070;">ON</span> Tickets <span style="color: #FFA070;">USING</span> hash (UserId);
<span style="color: #FFA070;">CREATE</span> INDEX <span style="color: #FFA070;">ON</span> Tickets <span style="color: #FFA070;">USING</span> btree (FlightId,SeatId);
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#1040;&#1074;&#1090;&#1086;&#1088;: Михаил Волхов M3438</p>
<p class="date">Created: 2016-11-29 Tue 13:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
